class Answers:

    Answer_0 = 'Сутки — 400 рублей. Оплата курьеру — наличными или картой.'
    Answer_1 = 'Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто ' \
               'сделать несколько заказов — один за другим.'
    Answer_2 = 'Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени ' \
               'аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, ' \
               'суточная аренда закончится 9 мая в 20:30.'
    Answer_3 = 'Только начиная с завтрашнего дня. Но скоро станем расторопнее.'
    Answer_4 = 'Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.'
    Answer_5 = 'Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься ' \
               'без передышек и во сне. Зарядка не понадобится.'
    Answer_6 = 'Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.'
    Answer_7 = 'Да, обязательно. Всем самокатов! И Москве, и Московской области.'


class DataForGenerators:

    first_name_list = ['Иван', 'Олег', 'Анна', 'Петр', 'Диана', 'Василий', 'Виктория', 'Сергей', 'Павел', 'Елена',
                       'Дмитрий',
                       'Михаил']

    last_name_list = ['Иванов', 'Петров', 'Сидоров', 'Смирнов', 'Васильев', 'Котов', 'Степанов']

    address_list = ['Петровская ул, 2', 'Новочеркасский пр, 36', 'Республиканская ул. 23к1 ', 'Центральная 26',
                    'Красная прощадь', 'Дворцовая площадь', 'Одесская, 2', ' ']

    station_name = ['Сокольники', 'Спортивная', 'Юго-Западная', 'Черкизовская', 'Университет']

    comment_list = ['нужен сегодня', 'срочно', 'сам хочу забрать', '-', 'а может есть другие цвета?']

    delivery_date = ['29.11.2024', '30.11.2024', '01.12.2024']

    scooter_color = ['чёрный жемчуг', 'серая безысходность']
